app/controllers/api/v1/items_controller.rb

INSERT INTO "items" ("name", "category", "unitofmeasurement", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "a"], ["category", ""], ["unitofmeasurement", ""], ["quantity", 8], ["created_at", "2022-03-25 20:58:55.782741"], ["updated_at", "2022-03-25 20:58:55.782741"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "name" = ?, "category" = ?, "unitofmeasurement" = ?, "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Groundnut Oil"], ["category", "Oils"], ["unitofmeasurement", "Gallon"], ["quantity", 80], ["updated_at", "2022-03-25 22:11:49.467554"], ["id", 6]]
---
  def update
    if @item.update(item_params)